package javatraining;
/**
 * 【教科書p74　問題12-4】
 * サブクラスを宣言する問題
 * @author iyo-marina
 *
 */
public class PlacedRectangle extends Rectangle {
//====宣言==============================================================================================================
//----フィールド--------------------------------------------------------------------------------------------------------
    // 	位置を表すint型変数x,yを宣言
    int x;
    int y;

//----コンストラクタ----------------------------------------------------------------------------------------------------
    // ①引数なし
    public PlacedRectangle() {
        setLocation(0, 0);
    }

    // ②位置つき
    public PlacedRectangle(int x, int y) {
        setLocation(x, y);
    }

    // ③位置と大きさつき
    public PlacedRectangle(int x, int y, int w, int h) {
        setLocation(x, y);
        setSize(w, h);
    }


//----メソッド----------------------------------------------------------------------------------------------------------
    // 位置を変更するメソッド
    public void setLocation(int x, int y) {
        this.x = x;
        this.y = y;
    }

    // 標準的な文字列表現
    @Override
    public String toString() {
        return "[" + "(" + x + "," + y + ")" + "[" + width + ", " + height + "]" + "]";
    }

//====メインメソッド====================================================================================================


}